// Задача 35: Задайте одномерный массив из 123 случайных чисел.
// Найдите количество элементов массива, значения которых лежат в
// отрезке [10,99].
// Пример для массива из 5, а не 123 элементов. В своём решении сделайте для
// 123
// [5, 18, 123, 6, 2] -> 1
// [1, 2, 3, 6, 2] -> 0
// [10, 11, 12, 13, 14] -> 5

Console.Clear();

int[] CreateArrayRndInt(int size, int min, int max)
{
	int[] arr = new int[size];
	Random rnd = new Random();

	for (int i = 0; i < size; i++)
	{
		arr[i] = rnd.Next(min, max + 1);
	}
	return arr;
}
int Number(int[] arr)
{
	int result = 0;
	for (int i = 0; i < arr.Length; i++)
	{
		if (arr[i] >= 10 && arr[i] <= 99) result = result + 1;
	}
	return result;
}

void PrintArray(int[] arr)
{
	for (int i = 0; i < arr.Length; i++)
	{
		if (i == 0) Console.Write("[");
		if (i < arr.Length - 1) Console.Write(arr[i] + ",");
		else Console.Write(arr[i] + "]");
	}
}

int[] array = CreateArrayRndInt(123, 0, 1000);
int number = Number(array);
PrintArray(array);
Console.WriteLine();
Console.WriteLine($"Количество элементов в массиве от 10 до 99 = {number}");
